emas/loadtest/emas-performance-report/raw_data/sp1/apache_bench_data/500cus/varnish_ab_test_500_10000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      500
Time taken for tests:   0.731 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      325520000 bytes
HTML transferred:       319660000 bytes
Requests per second:    13681.80 [#/sec] (mean)
Time per request:       36.545 [ms] (mean)
Time per request:       0.073 [ms] (mean, across all concurrent requests)
Transfer rate:          434931.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       10   13   2.2     13      22
Processing:    11   23   4.4     23      38
Waiting:        3   12   5.0     13      24
Total:         26   36   4.7     37      50

Percentage of the requests served within a certain time (ms)
  50%     37
  66%     38
  75%     38
  80%     39
  90%     41
  95%     44
  98%     46
  99%     49
 100%     50 (longest request)